; =========================================
; 模块名称：数码管显示模块
; 功能描述：动态扫描显示 C875
; =========================================
SHOW_C875:
    ; --- 显示第 1 位：'C' ---
    MOV P2, #11111111B  ; 初始状态
    CLR P2.2
    CLR P2.3
    CLR P2.4            ; 选中第 1 个管
    MOV P0, #39H        ; 'C' 的段码
    LCALL DELAY
    MOV P0, #00H        ; 消影

    ; --- 显示第 2 位：'8' ---
    SETB P2.2
    CLR P2.3
    CLR P2.4            ; 选中第 2 个管
    MOV P0, #7FH        ; '8' 的段码
    LCALL DELAY
    MOV P0, #00H        ; 消影

    ; --- 显示第 3 位：'7' ---
    CLR P2.2
    SETB P2.3
    CLR P2.4            ; 选中第 3 个管
    MOV P0, #07H        ; '7' 的段码
    LCALL DELAY
    MOV P0, #00H        ; 消影

    ; --- 显示第 4 位：'5' ---
    SETB P2.2
    SETB P2.3
    CLR P2.4            ; 选中第 4 个管
    MOV P0, #6DH        ; '5' 的段码
    LCALL DELAY
    MOV P0, #00H        ; 消影

    RET                 ; 模块执行完毕，返回主程序